# 문제 1

# 풀이 순서
# 1. range로 1부터 10까지 숫자를 만든다.
# 2. 숫자를 하나씩 i에 넣는다.
# 3. i를 출력한다.

for i in range(1, 11):
    print(i)               

#print("i")를 하면 문자 i가 출력이 된다.

#문제 2

# 풀이 순서
# 1. 합계를 저장할 total을 0으로 만든다.
# 2. 1부터 100까지 숫자를 반복한다.
# 3. 각 숫자를 total에 더한다.
# 4. 반복이 끝난 후 total을 출력한다.

total = 0

for j in range(1, 101):
    total += j

print(total)

# sum은 Python에 있는 함수이므로
# 합계는 sum이 아니라 total로 하라고 권고수정받음

# 문제 3

# 풀이 순서
# 1. range로 1부터 20까지 숫자를 만든다.
# 2. 숫자를 하나씩 k에 넣는다.
# 3. k가 홀수이면 continue로 아래 코드를 건너뛴다.
# 4. 홀수가 아닌 짝수만 출력한다.

for k in range(1, 21):
    if k  % 2 == 1:
        continue

    print(k)

#문제 4

# 풀이 순서
# 1. 사용자에게 숫자 하나를 입력받아 num에 저장한다.
# 2. range로 1부터 9까지 숫자를 만든다.
# 3. 숫자를 하나씩 i에 넣는다.
# 4. num, l, num * l를 구구단 형식으로 출력한다.

num = int(input("숫자 하나를 입력하세요: "))

for l in range(1,10):
    print(str(num) + " * "+ str(l) + " = " + str(num * l))

# print()에서는
# 1. +는 문자열, 정수를 결합할 수 없으니 타입을 맞춰주자
# 2. +가 아닌 ,를 사용하면 정수의 타입을 안 변환 시켜줘도 된다.
# 3. print에서는 *, = 같은 연산자는 계산을 하니 출력할려면 ""를 써주자
# 4. 어지간해서는 f-string방법이 좋다.
# 5. l값을 반복한다기 보다는 변수 l값이 1부터 9까지 차례로 바뀐다고 하는게 정확하다.

# 문제 5

# 풀이 순서
# 1. range로 5부터 1까지 숫자를 만든다.
# 2. 증감값을 -1로 설정한다.
# 3. 숫자를 하나씩 m에 넣는다.
# 4. m를 출력한다.
# 5. 반복이 끝난 후 "시작!"을 출력한다.

for m in range(5, 0, -1):
    print(m)

print("시작!")

# range는 증감값의 default가 +1이므로
# 큰 수에서 작은 수로 갈 때는 반드시 증감값을 -1로 설정해야한다

# 문제 6

# 풀이 순서
# 1. while True로 비밀번호 입력을 계속 반복한다.
# 2. 입력받은 값을 정수로 바꾸어 password에 저장한다.
# 3. password가 1234이면 "로그인 성공"을 출력하고 break로 반복문을 종료한다.
# 4. password가 1234가 아니면 "비밀번호가 틀렸습니다."를 출력한다.

while True:
    password = int(input("비밀번호를 입력해주세요: "))

    if password == 1234:
        print("로그인 성공")
        break

    print("비밀번호가 틀렸습니다.")

# 1.
# password = int(input("비밀번호를 입력해주세요: "))를
# 반복문 밖으로 빼주면 비밀번호가 틀렸을 때 
# 틀린 값이 지속되므로
# 무한루프가 걸린다.
# 2.
# password가 1234이면 break가 실행되어 반복문이 바로 끝난다.
# 따라서 그 아래의 "비밀번호가 틀렸습니다."는 실행되지 않는다.
# password가 1234가 아닐 때만 아래 출력문까지 내려오므로 else가 없어도 된다.